OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf18875.c
/*
 * This definitions of the PIC16LF18875 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:25 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#include <pic16lf18875.h>

//==============================================================================

__at(0x0000) __sfr INDF0;

__at(0x0001) __sfr INDF1;

__at(0x0002) __sfr PCL;

__at(0x0003) __sfr STATUS;
__at(0x0003) volatile __STATUSbits_t STATUSbits;

__at(0x0004) __sfr FSR0;

__at(0x0004) __sfr FSR0L;

__at(0x0005) __sfr FSR0H;

__at(0x0006) __sfr FSR1;

__at(0x0006) __sfr FSR1L;

__at(0x0007) __sfr FSR1H;

__at(0x0008) __sfr BSR;
__at(0x0008) volatile __BSRbits_t BSRbits;

__at(0x0009) __sfr WREG;

__at(0x000A) __sfr PCLATH;

__at(0x000B) __sfr INTCON;
__at(0x000B) volatile __INTCONbits_t INTCONbits;

__at(0x000C) __sfr PORTA;
__at(0x000C) volatile __PORTAbits_t PORTAbits;

__at(0x000D) __sfr PORTB;
__at(0x000D) volatile __PORTBbits_t PORTBbits;

__at(0x000E) __sfr PORTC;
__at(0x000E) volatile __PORTCbits_t PORTCbits;

__at(0x000F) __sfr PORTD;
__at(0x000F) volatile __PORTDbits_t PORTDbits;

__at(0x0010) __sfr PORTE;
__at(0x0010) volatile __PORTEbits_t PORTEbits;

__at(0x0011) __sfr TRISA;
__at(0x0011) volatile __TRISAbits_t TRISAbits;

__at(0x0012) __sfr TRISB;
__at(0x0012) volatile __TRISBbits_t TRISBbits;

__at(0x0013) __sfr TRISC;
__at(0x0013) volatile __TRISCbits_t TRISCbits;

__at(0x0014) __sfr TRISD;
__at(0x0014) volatile __TRISDbits_t TRISDbits;

__at(0x0015) __sfr TRISE;
__at(0x0015) volatile __TRISEbits_t TRISEbits;

__at(0x0016) __sfr LATA;
__at(0x0016) volatile __LATAbits_t LATAbits;

__at(0x0017) __sfr LATB;
__at(0x0017) volatile __LATBbits_t LATBbits;

__at(0x0018) __sfr LATC;
__at(0x0018) volatile __LATCbits_t LATCbits;

__at(0x0019) __sfr LATD;
__at(0x0019) volatile __LATDbits_t LATDbits;

__at(0x001A) __sfr LATE;
__at(0x001A) volatile __LATEbits_t LATEbits;

__at(0x001C) __sfr TMR0;
__at(0x001C) volatile __TMR0bits_t TMR0bits;

__at(0x001C) __sfr TMR0L;
__at(0x001C) volatile __TMR0Lbits_t TMR0Lbits;

__at(0x001D) __sfr PR0;
__at(0x001D) volatile __PR0bits_t PR0bits;

__at(0x001D) __sfr TMR0H;
__at(0x001D) volatile __TMR0Hbits_t TMR0Hbits;

__at(0x001E) __sfr T0CON0;
__at(0x001E) volatile __T0CON0bits_t T0CON0bits;

__at(0x001F) __sfr T0CON1;
__at(0x001F) volatile __T0CON1bits_t T0CON1bits;

__at(0x008C) __sfr ADRES;

__at(0x008C) __sfr ADRESL;

__at(0x008D) __sfr ADRESH;

__at(0x008E) __sfr ADPREV;

__at(0x008E) __sfr ADPREVL;
__at(0x008E) volatile __ADPREVLbits_t ADPREVLbits;

__at(0x008F) __sfr ADPREVH;
__at(0x008F) volatile __ADPREVHbits_t ADPREVHbits;

__at(0x0090) __sfr ADACC;

__at(0x0090) __sfr ADACCL;
__at(0x0090) volatile __ADACCLbits_t ADACCLbits;

__at(0x0091) __sfr ADACCH;
__at(0x0091) volatile __ADACCHbits_t ADACCHbits;

__at(0x0093) __sfr ADCON0;
__at(0x0093) volatile __ADCON0bits_t ADCON0bits;

__at(0x0094) __sfr ADCON1;
__at(0x0094) volatile __ADCON1bits_t ADCON1bits;

__at(0x0095) __sfr ADCON2;
__at(0x0095) volatile __ADCON2bits_t ADCON2bits;

__at(0x0096) __sfr ADCON3;
__at(0x0096) volatile __ADCON3bits_t ADCON3bits;

__at(0x0097) __sfr ADSTAT;
__at(0x0097) volatile __ADSTATbits_t ADSTATbits;

__at(0x0098) __sfr ADCLK;
__at(0x0098) volatile __ADCLKbits_t ADCLKbits;

__at(0x0099) __sfr ADACT;
__at(0x0099) volatile __ADACTbits_t ADACTbits;

__at(0x009A) __sfr ADREF;
__at(0x009A) volatile __ADREFbits_t ADREFbits;

__at(0x009B) __sfr ADCAP;
__at(0x009B) volatile __ADCAPbits_t ADCAPbits;

__at(0x009C) __sfr ADPRE;
__at(0x009C) volatile __ADPREbits_t ADPREbits;

__at(0x009D) __sfr ADACQ;
__at(0x009D) volatile __ADACQbits_t ADACQbits;

__at(0x009E) __sfr ADPCH;
__at(0x009E) volatile __ADPCHbits_t ADPCHbits;

__at(0x010C) __sfr ADCNT;
__at(0x010C) volatile __ADCNTbits_t ADCNTbits;

__at(0x010D) __sfr ADRPT;
__at(0x010D) volatile __ADRPTbits_t ADRPTbits;

__at(0x010E) __sfr ADLTH;

__at(0x010E) __sfr ADLTHL;
__at(0x010E) volatile __ADLTHLbits_t ADLTHLbits;

__at(0x010F) __sfr ADLTHH;
__at(0x010F) volatile __ADLTHHbits_t ADLTHHbits;

__at(0x0110) __sfr ADUTH;

__at(0x0110) __sfr ADUTHL;
__at(0x0110) volatile __ADUTHLbits_t ADUTHLbits;

__at(0x0111) __sfr ADUTHH;
__at(0x0111) volatile __ADUTHHbits_t ADUTHHbits;

__at(0x0112) __sfr ADSTPT;

__at(0x0112) __sfr ADSTPTL;
__at(0x0112) volatile __ADSTPTLbits_t ADSTPTLbits;

__at(0x0113) __sfr ADSTPTH;
__at(0x0113) volatile __ADSTPTHbits_t ADSTPTHbits;

__at(0x0114) __sfr ADFLTR;

__at(0x0114) __sfr ADFLTRL;
__at(0x0114) volatile __ADFLTRLbits_t ADFLTRLbits;

__at(0x0115) __sfr ADFLTRH;
__at(0x0115) volatile __ADFLTRHbits_t ADFLTRHbits;

__at(0x0116) __sfr ADERR;

__at(0x0116) __sfr ADERRL;
__at(0x0116) volatile __ADERRLbits_t ADERRLbits;

__at(0x0117) __sfr ADERRH;
__at(0x0117) volatile __ADERRHbits_t ADERRHbits;

__at(0x0119) __sfr RC1REG;

__at(0x0119) __sfr RCREG;

__at(0x0119) __sfr RCREG1;

__at(0x011A) __sfr TX1REG;

__at(0x011A) __sfr TXREG;

__at(0x011A) __sfr TXREG1;

__at(0x011B) __sfr SP1BRG;

__at(0x011B) __sfr SP1BRGL;

__at(0x011B) __sfr SPBRG;

__at(0x011B) __sfr SPBRG1;

__at(0x011B) __sfr SPBRGL;

__at(0x011C) __sfr SP1BRGH;

__at(0x011C) __sfr SPBRGH;

__at(0x011C) __sfr SPBRGH1;

__at(0x011D) __sfr RC1STA;
__at(0x011D) volatile __RC1STAbits_t RC1STAbits;

__at(0x011D) __sfr RCSTA;
__at(0x011D) volatile __RCSTAbits_t RCSTAbits;

